Autodesk.Revit.UI.IDockablePaneProvider.SetupDockablePane(Autodesk.Revit.UI.DockablePaneProviderData)
Method called during initialization of the user interface to gather information about a dockable pane window.
data:
Container for information about the new dockable pane.  Implementers should set the FrameworkElement and InitialState properties on the passed-in data object.
Since:
2014